# InitialLuminousIntensity Constructor (Double) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InitialLuminousIntensity Constructor (Double)
InitialLuminousIntensity Class See Also
---
Creates an initial luminous intensity object with the given document and luminosity values.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public InitialLuminousIntensity(
	double luminosity
)
```

Visual Basic
---
```text
Public Sub New ( _
	luminosity As Double _
)
```

Visual C++
---
```text
public:
InitialLuminousIntensity(
	double luminosity
)
```

# ### Parameters
luminosity
    Type: System..::..Double The luminosity value in cd as a numerical value between 0 and 1e+30.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The luminosity value is not valid because it is not between 0 and 1e+30. |

# See Also
InitialLuminousIntensity Class
InitialLuminousIntensity Overload
Autodesk.Revit.DB.Lighting Namespace